import { stringify } from 'qs';
import request from '../utils/request';

//---------------------------------------------库存管理部分-----------------------------------------
//-----------------库存 - 平台库存 页-----------
//平台库存 - 列表查询
export async function platformStock(params) {
  return request(`/llback/Sales/platformStock`,{
    method: 'POST',
    body: params,
  })
}
//平台库存 - 上传销售数据
export async function getUploadOrderbillDX(params) {
  return request(`/llback/Order/UploadOrderDXttt`, {
    method: 'POST',
    body: params,
  });
}
//-----------------库存 - 门店库存 页-----------

//---------------------------------------------发货管理部分-----------------------------------------
//-----------------发货单表单 页---------------


//-----------------选择发货商品 页--------------

//-----------------选择商品返回发货单（带参） 页--

//-----------------发货列表 页----------------

//-----------------发货列表- 查看发货单 页------

//---------------------------------------------销售管理部分-----------------------------------------
//-----------------门店销售//（查看弹窗） 页-----


//---------------------------------------------合同管理部分-----------------------------------------
//-----------------合同列表 页----------

//-----------------创建合同 页----------

//-----------------查看合同 页----------

//---------------------------------------------财务管理部分-----------------------------------------
//------------------采购结算 页---------

//------------------手动调账（查看） 页---



